//Написать программу, которая по введенному значению аргумента вычисляет значение функции, заданной в виде графика.
// До х = -2 у = 0
// От х = -2 до х = -1	у = -х
// От х = -1 до х = 0	у = х
// От х = 0 до х = 1	у = х
// От х = 1 до х = 2	у = -х
// От х = 2				у = 0

#include <iostream>
using namespace std;

void main()
{
	float x;
	cin >> x;

	while (x < 3)
	{

		float y = 0;
		if (x <= -2)				y = 0;
		else if (x > -2 && x <= -1)	y = -(x + 2);
		else if (x > -1 && x <= 1)	y = x;
		else if (x > 1 && x <= 2)	y = (1 - (x - 1));
		else if (x > 2)				y = 0;

		cout << x << '\t' << y << endl;
		x += 0.25;
	}

}